# RasterQuality Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintParameters..::..RasterQuality Property
PrintParameters Class See Also
---
The raster quality type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public RasterQualityType RasterQuality { get; set; }
```

Visual Basic
---
```text
Public Property RasterQuality As RasterQualityType
	Get
	Set
```

Visual C++
---
```text
public:
property RasterQualityType RasterQuality {
	RasterQualityType get ();
	void set (RasterQualityType value);
}
```

# See Also
PrintParameters Class
Autodesk.Revit.DB Namespace